RSN/src/Catalogs/ОбъектыМетаданныхИнформационныхБаз/ОбъектыМетаданныхИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданныхИнформационныхБаз</name>
  <owners>Catalog.ВидыМетаданных</owners>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВСервисе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИменаРеквизитовТипаДата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПриЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/ОбъектыМетаданныхИнформационныхБаз/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПояснениеКДопОбработчикам.Заголовок =
	"Для инициации доп. обработчиков, в теле запроса к сервису необходимо передать структуру ""ДопОбработчики[ВидОбрабочика]""
	|В дополнительных обработчиках используются следующие переменные: 
	|- ""ОбрабатываемыйОбъект"" - обрабатываемый элемент объекта метаданных;
	|- ""ВидОбработчика"" - строка - значения: ""ПередЗаписью"" или ""ПриЗаписи"";
	|- ""ПараметрыОбъекта"" - структура - ""техническая"" информация по объекту из справочника ""um_ОбъектыМетаданных"";
	|- ""РеквизитыЗапроса"" - структура - реквизиты, переданные в теле запроса к сервису";
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура СформироватьПредставление(Команда)
	СформироватьПредставлениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура СформироватьПредставлениеНаСервере()  
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъекта) Тогда
		Объект.ПредставлениеВСервисе = "";	
		Возврат;
	КонецЕсли;   
	
	ПараметрыПреобразованияJSON = Новый Структура("ПрочитатьВСоответствие", Истина);  
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыПреобразованияJSON", ПараметрыПреобразованияJSON);
		
	ПараметрыЗапроса = Новый Структура("sl, dl, text", "ru", "en", Объект.ИмяОбъекта);
		
	Попытка	
		Ответ = КоннекторHTTP.GetJson("https://ftapi.pythonanywhere.com/translate", ПараметрыЗапроса, ДополнительныеПараметры);  
		Объект.ПредставлениеВСервисе = СтрЗаменить((ТРег(Ответ.Получить("destination-text"))), " ", "");
	Исключение
		Объект.ПредставлениеВСервисе = СтроковыеФункции.СтрокаЛатиницей(Объект.ИмяОбъекта);	
	КонецПопытки;	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПроверкаНаДубльПредставления(ПредставлениеВСервисе, ОбъектМетаданных)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОбъектыМетаданныхИнформационныхБаз.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ОбъектыМетаданныхИнформационныхБаз КАК ОбъектыМетаданныхИнформационныхБаз
	               |ГДЕ
	               |	ОбъектыМетаданныхИнформационныхБаз.Ссылка <> &Ссылка
	               |	И ОбъектыМетаданныхИнформационныхБаз.ПредставлениеВСервисе = &ПредставлениеВСервисе";
	Запрос.УстановитьПараметр("ПредставлениеВСервисе",ПредставлениеВСервисе);
	Запрос.УстановитьПараметр("Ссылка",ОбъектМетаданных);
	
	Результат = Запрос.Выполнить();
	Возврат  Результат.Пустой();
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Ответ = ПроверкаНаДубльПредставления(Объект.ПредставлениеВСервисе, Объект.Ссылка);
	Если Ответ Тогда 
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ОбщегоНазначенияКлиент.СообщитьПользователю("Существуют ОбъектыМетаданныхИнформационныхБаз, с таким же представлением: " + Объект.ПредставлениеВСервисе);
КонецПроцедуры

#КонецОбласти
